#1 Import necessary libraries

In [5]:
import sqlite3
import pandas as pd

#2 Create a connection

In [6]:
con = sqlite3.connect("cademycode.db")

In [7]:
data_base = pd.read_sql_query("SELECT * FROM sqlite_master", con)
data_base.head()

,type,name,tbl_name,rootpage,sql
0,table,cademycode_students,cademycode_students,2,CREATE TABLE cademycode_students (\n\tuuid INT...
1,table,cademycode_courses,cademycode_courses,5,CREATE TABLE cademycode_courses (\n\tcareer_pa...
2,table,cademycode_student_jobs,cademycode_student_jobs,6,CREATE TABLE cademycode_student_jobs (\n\tjob_...

In [18]:
students = pd.read_sql_query("SELECT * FROM cademycode_students", con)
students.head()

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
0,1,Annabelle Avery,1943-07-03,F,"{""mailing_address"": ""303 N Timber Key, Irondal...",7.0,6.0,1.0,4.99
1,2,Micah Rubio,1991-02-07,M,"{""mailing_address"": ""767 Crescent Fair, Shoals...",7.0,5.0,8.0,4.4
2,3,Hosea Dale,1989-12-07,M,"{""mailing_address"": ""P.O. Box 41269, St. Bonav...",7.0,8.0,8.0,6.74
3,4,Mariann Kirk,1988-07-31,F,"{""mailing_address"": ""517 SE Wintergreen Isle, ...",6.0,7.0,9.0,12.31
4,5,Lucio Alexander,1963-08-31,M,"{""mailing_address"": ""18 Cinder Cliff, Doyles b...",7.0,14.0,3.0,5.64

In [19]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   contact_info            5000 non-null   object
 5   job_id                  4995 non-null   object
 6   num_course_taken        4749 non-null   object
 7   current_career_path_id  4529 non-null   object
 8   time_spent_hrs          4529 non-null   object
dtypes: int64(1), object(8)
memory usage: 351.7+ KB

In [20]:
students.describe()

              uuid
count  5000.000000
mean   2500.500000
std    1443.520003
min       1.000000
25%    1250.750000
50%    2500.500000
75%    3750.250000
max    5000.000000

In [21]:
students.value_counts()

uuid  name                    dob         sex  contact_info                                                                                                          job_id  num_course_taken  current_career_path_id  time_spent_hrs
1     Annabelle Avery         1943-07-03  F    {"mailing_address": "303 N Timber Key, Irondale, Wisconsin, 84736", "email": "annabelle_avery9376@woohoo.com"}        7.0     6.0               1.0                     4.99              1
3337  Greg Allan              1968-09-16  M    {"mailing_address": "554 Broad Rose, Flagler Beach, Florida, 65799", "email": "allan8306@inlook.com"}                 5.0     1.0               7.0                     24.78             1
3322  Jerald Mendez           1961-09-18  M    {"mailing_address": "700 SE Quail Vista, Petrey, New Mexico, 49882", "email": "jerald_mendez392@hmail.com"}           2.0     4.0               10.0                    6.44              1
3323  Clarisa Oneill          1953-12-21  F    {"mailing_address": "799 Pleasant Road, Black Springs, Virginia, 67102", "email": "clarisa_oneill7269@inlook.com"}    4.0     10.0              8.0                     16.49             1
3324  Gertrud Haak            1988-02-26  F    {"mailing_address": "919 Fork Track, Jordan Valley, Iowa, 90136", "email": "gertrud_haak8891@coldmail.com"}           5.0     9.0               10.0                    0.74              1
                                                                                                                                                                                                                                        ..
1668  Mervin Bradshaw         2003-04-25  M    {"mailing_address": "269 Lost Mall Shore, Oconto Falls, North Carolina, 01316", "email": "bradshaw641@coldmail.com"}  8.0     8.0               1.0                     19.3              1
1670  Bernardo Montes         2001-08-05  M    {"mailing_address": "353 NW Well Street, De Graff village, Vermont, 64718", "email": "bernardo3706@inlook.com"}       3.0     12.0              5.0                     2.12              1
1671  Lee van der Sluijs      1954-03-13  N    {"mailing_address": "561 Quiet Trail, Lisle village, Arizona, 62788", "email": "lee5111@hmail.com"}                   4.0     7.0               8.0                     7.47              1
1672  Clarissa van Bolswaerd  1995-11-05  F    {"mailing_address": "206 Robin Harbor, West Carson, Indiana, 18468", "email": "clarissa2901@woohoo.com"}              5.0     5.0               9.0                     5.4               1
5000  Elton Otway             1994-12-23  M    {"mailing_address": "406 Zephyr Port, Oskaloosa, Alabama, 74534", "email": "elton_otway5644@inlook.com"}              2.0     5.0               3.0                     10.04             1
Name: count, Length: 4293, dtype: int64

In [15]:
courses = pd.read_sql_query("SELECT * FROM cademycode_courses", con)
courses.head()

   career_path_id      career_path_name  hours_to_complete
0               1        data scientist                 20
1               2         data engineer                 20
2               3          data analyst                 12
3               4  software engineering                 25
4               5      backend engineer                 18

In [22]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   career_path_id     10 non-null     int64
 1   career_path_name   10 non-null     object
 2   hours_to_complete  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [23]:
courses.describe()

       career_path_id  hours_to_complete
count        10.00000          10.000000
mean          5.50000          21.900000
std           3.02765           6.707376
min           1.00000          12.000000
25%           3.25000          18.500000
50%           5.50000          20.000000
75%           7.75000          26.500000
max          10.00000          35.000000

In [24]:
courses.value_counts()

career_path_id  career_path_name           hours_to_complete
1               data scientist             20                   1
2               data engineer              20                   1
3               data analyst               12                   1
4               software engineering       25                   1
5               backend engineer           18                   1
6               frontend engineer          20                   1
7               iOS developer              27                   1
8               android developer          27                   1
9               machine learning engineer  35                   1
10              ux/ui designer             15                   1
Name: count, dtype: int64

In [16]:
student_jobs = pd.read_sql_query("SELECT * FROM cademycode_student_jobs", con)
student_jobs.head()

   job_id        job_category  avg_salary
0       1           analytics       86000
1       2            engineer      101000
2       3  software developer      110000
3       4            creative       66000
4       5  financial services      135000

In [25]:
student_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   job_id        13 non-null     int64
 1   job_category  13 non-null     object
 2   avg_salary    13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 444.0+ bytes

In [26]:
student_jobs.describe()

          job_id     avg_salary
count  13.000000      13.000000
mean    4.384615   89230.769231
std     2.662657   34727.879881
min     0.000000   10000.000000
25%     3.000000   66000.000000
50%     4.000000   86000.000000
75%     6.000000  110000.000000
max     9.000000  135000.000000

In [27]:
student_jobs.value_counts()

job_id  job_category        avg_salary
3       software developer  110000        2
4       creative            66000         2
5       financial services  135000        2
0       other               80000         1
1       analytics           86000         1
2       engineer            101000        1
6       education           61000         1
7       HR                  80000         1
8       student             10000         1
9       healthcare          120000        1
Name: count, dtype: int64